wirex/stm32h7/stm32h7_battery_monitor_flash_uart_spi.c
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <string.h>

// 상수 정의
#define FLASH_DATA_SECTOR 1              // 데이터 저장용 SPI 플래시 섹터 (섹터 1)
#define FLASH_METADATA_ADDR ((uint32_t)0x00000000) // 메타데이터 저장 주소 (섹터 0)
#define FLASH_DATA_ADDR ((uint32_t)0x00001000)     // 데이터 저장 시작 주소 (섹터 1)
#define DATA_10S_SIZE sizeof(DataRecord10s)        // 10초 데이터 레코드 크기 (18바이트)
#define DATA_1MIN_SIZE sizeof(DataRecord1min)      // 1분 데이터 레코드 크기 (14바이트)
#define UART_RX_BUFFER_SIZE 32                    // UART 수신 버퍼 크기
#define SPI_RX_BUFFER_SIZE 256                    // SPI 읽기 버퍼 크기 (페이지 단위)
#define BUTTON_DEBOUNCE_MS 50                     // 버튼 디바운싱 시간 (50ms)
#define BUTTON_LONG_PRESS_MS 2000                 // 긴 누름 판단 기준 시간 (2초)
#define INIT_FLAG 0xA5A5A5A5                      // 초기화 플래그 값

// 전역 변수 선언
ADC_HandleTypeDef hadc1, hadc2;                   // ADC1(전압), ADC2(전류) 핸들
DMA_HandleTypeDef hdma_adc1, hdma_adc2;           // ADC DMA 핸들
RTC_HandleTypeDef hrtc;                           // RTC 핸들
UART_HandleTypeDef huart1;                        // UART1 핸들
SPI_HandleTypeDef hspi1;                          // SPI1 핸들
TIM_HandleTypeDef htim2;                          // TIM2 핸들 (버튼 디바운싱/누름 시간)
uint32_t voltage_buffer[128], current_buffer[128]; // ADC 데이터 버퍼
float battery_voltage, battery_current, battery_power; // 배터리 전압(V), 전류(mA), 전력(mW)
float voltage_sum, current_sum, power_sum;         // 1분 평균 계산용 합계
uint32_t sample_count_1min;                       // 1분 샘플 카운트
uint8_t uart_rx_buffer[UART_RX_BUFFER_SIZE];      // UART 수신 버퍼
uint8_t spi_rx_buffer[SPI_RX_BUFFER_SIZE];        // SPI 읽기 버퍼
uint8_t uart_rx_index = 0;                        // UART 수신 버퍼 인덱스
volatile uint32_t button_press_time = 0;          // 버튼 누름 시작 시간
volatile uint8_t button_state = 0;                // 버튼 상태 (0: 대기, 1: 누름, 2: 긴 누름)

// 데이터 구조체 정의
typedef struct {
    uint32_t timestamp;  // RTC 초 단위 타임스탬프
    float voltage;       // 전압 (V)
    float current;       // 전류 (mA)
    float power;         // 전력 (mW)
    uint16_t crc;        // CRC16 체크섬
} DataRecord10s;

typedef struct {
    float avg_voltage;   // 평균 전압 (V)
    float avg_current;   // 평균 전류 (mA)
    float avg_power;     // 평균 전력 (mW)
    uint16_t crc;        // CRC16 체크섬
} DataRecord1min;

typedef struct {
    uint32_t last_write_addr; // 마지막 데이터 기록 주소
    uint32_t sector_index;    // 현재 섹터 인덱스
    uint32_t init_flag;       // 초기화 상태 플래그
} FlashMetadata;

// 함수 선언
void SystemClock_Config(void);
void RTC_Init(void);
void ADC1_Init(void);
void ADC2_Init(void);
void UART1_Init(void);
void SPI1_Init(void);
void TIM2_Init(void);
void GPIO_Button_Init(void);
void LED_Flash(uint8_t pattern);
void Calculate_Voltage_Current(void);
void Write_SPI_Flash(uint32_t addr, void* data, uint32_t size);
void Read_SPI_Flash(uint32_t addr, void* data, uint32_t size);
void Erase_SPI_Flash_Sector(uint32_t sector);
void Erase_SPI_Flash_Chip(void);
void Reset_Data_Log(void);
void Read_Flash_Metadata(FlashMetadata* metadata);
void Write_Flash_Metadata(FlashMetadata* metadata);
void Process_UART_Data(void);
int Validate_DateTime(uint16_t year, uint8_t month, uint8_t day, uint8_t hour, uint8_t minute);
void Set_RTC(uint16_t year, uint8_t month, uint8_t day, uint8_t hour, uint8_t minute);
void Analyze_Battery_Status(void);
uint16_t Calculate_CRC16(void* data, uint32_t size);

/**
 * @brief 메인 함수
 * @details 시스템 초기화, ADC/UART/SPI/TIM/GPIO 설정 후 데이터 기록 및 버튼/UART 명령 처리
 */
int main(void) {
    HAL_Init(); // HAL 라이브러리 초기화
    SystemClock_Config(); // 시스템 클럭 설정
    RTC_Init(); // RTC 초기화
    ADC1_Init(); // ADC1(전압) 초기화
    ADC2_Init(); // ADC2(전류) 초기화
    UART1_Init(); // UART1 초기화
    SPI1_Init(); // SPI1 초기화
    TIM2_Init(); // TIM2 초기화 (버튼 디바운싱)
    GPIO_Button_Init(); // 버튼 및 LED GPIO 초기화

    // 메타데이터 읽기
    FlashMetadata metadata;
    Read_Flash_Metadata(&metadata);
    uint32_t current_write_addr = metadata.last_write_addr;
    // 메타데이터 유효성 확인 및 초기화
    if (current_write_addr == 0xFFFFFFFF || current_write_addr >= FLASH_DATA_ADDR + 252 * 1024 || metadata.init_flag != INIT_FLAG) {
        current_write_addr = FLASH_DATA_ADDR;
        Erase_SPI_Flash_Sector(FLASH_DATA_SECTOR); // 데이터 섹터 초기화
        metadata.last_write_addr = current_write_addr;
        metadata.sector_index = FLASH_DATA_SECTOR;
        metadata.init_flag = INIT_FLAG;
        Write_Flash_Metadata(&metadata);
    }

    // ADC DMA 시작
    HAL_ADC_Start_DMA(&hadc1, (uint32_t*)voltage_buffer, 128);
    HAL_ADC_Start_DMA(&hadc2, (uint32_t*)current_buffer, 128);
    // UART 수신 인터럽트 시작
    HAL_UART_Receive_IT(&huart1, &uart_rx_buffer[uart_rx_index], 1);

    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};
    uint32_t last_10s = 0, last_1min = 0;
    voltage_sum = 0;
    current_sum = 0;
    power_sum = 0;
    sample_count_1min = 0;

    // 메인 루프
    while (1) {
        // 현재 시간 가져오기
        HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
        HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
        uint32_t current_time = sTime.Hours * 3600 + sTime.Minutes * 60 + sTime.Seconds;

        // 배터리 데이터 계산
        Calculate_Voltage_Current();
        voltage_sum += battery_voltage;
        current_sum += battery_current;
        power_sum += battery_power;
        sample_count_1min++;

        // 10초마다 데이터 기록
        if (current_time >= last_10s + 10) {
            DataRecord10s record = {
                .timestamp = current_time,
                .voltage = battery_voltage,
                .current = battery_current,
                .power = battery_power,
                .crc = Calculate_CRC16(&record, DATA_10S_SIZE - 2)
            };
            Write_SPI_Flash(current_write_addr, &record, DATA_10S_SIZE);
            current_write_addr += DATA_10S_SIZE;
            last_10s = current_time;

            // 디버깅 출력
            printf("10s: Time=%lus, V=%.2fV, I=%.2fmA, P=%.2fmW\n",
                   record.timestamp, record.voltage, record.current, record.power);
        }

