wirex/stm32h7/stm32h7_battery_monitor_flash_uart_spi.c
        // 1분마다 평균 데이터 기록
        if (current_time >= last_1min + 60) {
            DataRecord1min record = {
                .avg_voltage = voltage_sum / sample_count_1min,
                .avg_current = current_sum / sample_count_1min,
                .avg_power = power_sum / sample_count_1min,
                .crc = Calculate_CRC16(&record, DATA_1MIN_SIZE - 2)
            };
            Write_SPI_Flash(current_write_addr, &record, DATA_1MIN_SIZE);
            current_write_addr += DATA_1MIN_SIZE;
            last_1min = current_time;

            // 디버깅 출력
            printf("1min: Avg V=%.2fV, Avg I=%.2fmA, Avg P=%.2fmW\n",
                   record.avg_voltage, record.avg_current, record.avg_power);

            // 평균 데이터 초기화
            voltage_sum = 0;
            current_sum = 0;
            power_sum = 0;
            sample_count_1min = 0;

            // 데이터 섹터 끝 도달 시 초기화
            if (current_write_addr >= FLASH_DATA_ADDR + 252 * 1024 - DATA_10S_SIZE) {
                current_write_addr = FLASH_DATA_ADDR;
                Erase_SPI_Flash_Sector(FLASH_DATA_SECTOR);
            }

            // 메타데이터 업데이트
            metadata.last_write_addr = current_write_addr;
            metadata.sector_index = FLASH_DATA_SECTOR;
            metadata.init_flag = INIT_FLAG;
            Write_Flash_Metadata(&metadata);
        }

        HAL_Delay(100); // 100ms 대기
    }
}

/**
 * @brief 시스템 클럭 설정
 * @details HSE(8MHz)와 PLL로 400MHz 시스템 클럭 설정, RTC 클럭 활성화
 */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    // HSE 및 LSE 활성화, PLL 설정
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_LSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.LSEState = RTC_LSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 5;
    RCC_OscInitStruct.PLL.PLLN = 192;
    RCC_OscInitStruct.PLL.PLLP = 2;
    RCC_OscInitStruct.PLL.PLLQ = 2;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    // 시스템 클럭, AHB/APB 설정
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4);

    __HAL_RCC_RTC_ENABLE(); // RTC 클럭 활성화
}

/**
 * @brief RTC 초기화
 * @details LSE(32.768kHz)로 RTC 설정, 기본 시간(2025/05/26 00:00:00) 설정
 */
void RTC_Init(void) {
    hrtc.Instance = RTC;
    hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
    hrtc.Init.AsynchPrediv = 127;
    hrtc.Init.SynchPrediv = 255;
    hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
    HAL_RTC_Init(&hrtc);

    // 초기 시간 설정
    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};
    sTime.Hours = 0;
    sTime.Minutes = 0;
    sTime.Seconds = 0;
    sDate.Year = 25;
    sDate.Month = 5;
    sDate.Date = 26;
    HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
}

/**
 * @brief UART1 초기화
 * @details 115200 baud, PA9(TX), PA10(RX), 인터럽트 활성화
 */
void UART1_Init(void) {
    __HAL_RCC_USART1_CLK_ENABLE(); // USART1 클럭 활성화

    huart1.Instance = USART1;
    huart1.Init.BaudRate = 115200;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart1);

    // UART GPIO 설정
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    __HAL_RCC_GPIOA_CLK_ENABLE();
    GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // UART 인터럽트 활성화
    HAL_NVIC_SetPriority(USART1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(USART1_IRQn);
}

/**
 * @brief SPI1 초기화
 * @details W25Q128용 SPI1 설정, PA5(SCK), PA6(MISO), PA7(MOSI), PB0(CS)
 */
void SPI1_Init(void) {
    __HAL_RCC_SPI1_CLK_ENABLE(); // SPI1 클럭 활성화

    hspi1.Instance = SPI1;
    hspi1.Init.Mode = SPI_MODE_MASTER;
    hspi1.Init.Direction = SPI_DIRECTION_2LINES;
    hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
    hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
    hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi1.Init.NSS = SPI_NSS_SOFT;
    hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
    hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
    hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
    hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    HAL_SPI_Init(&hspi1);

    // SPI GPIO 설정
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // CS 핀 설정
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET); // CS 비활성화
}

/**
 * @brief TIM2 초기화
 * @details 버튼 디바운싱 및 긴 누름 감지를 위한 1ms 틱 타이머
 */
void TIM2_Init(void) {
    __HAL_RCC_TIM2_CLK_ENABLE(); // TIM2 클럭 활성화

