wirex/stm32h7/stm32h7_battery_monitor_flash_uart_spi.c
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = (SystemCoreClock / 1000) - 1; // 1ms 틱
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = 0xFFFF;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_Base_Init(&htim2);

    // 타이머 인터럽트 활성화
    HAL_NVIC_SetPriority(TIM2_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

/**
 * @brief 버튼 및 LED GPIO 초기화
 * @details PB1(버튼, EXTI1, 풀업), PC13(LED, 오픈 드레인)
 */
void GPIO_Button_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    __HAL_RCC_GPIOB_CLK_ENABLE();

    // 버튼: PB1, 내부 풀업, EXTI1
    GPIO_InitStruct.Pin = GPIO_PIN_1;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    // LED: PC13, 오픈 드레인, 액티브 로우
    __HAL_RCC_GPIOC_CLK_ENABLE();
    GPIO_InitStruct.Pin = GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // LED 끄기

    // EXTI 인터럽트 활성화
    HAL_NVIC_SetPriority(EXTI1_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
}

/**
 * @brief LED 점멸
 * @param pattern 1: 빠른 점멸(진행 중), 2: 느린 점멸(완료)
 */
void LED_Flash(uint8_t pattern) {
    if (pattern == 1) { // 빠른 점멸 (100ms 간격, 4회)
        for (int i = 0; i < 4; i++) {
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); // LED 켜기
            HAL_Delay(100);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // LED 끄기
            HAL_Delay(100);
        }
    } else if (pattern == 2) { // 느린 점멸 (500ms 간격, 2회)
        for (int i = 0; i < 2; i++) {
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(500);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(500);
        }
    }
}

/**
 * @brief 배터리 전압/전류/전력 계산
 * @details ADC 데이터 평균화 후 전압(V), 전류(mA), 전력(mW) 계산
 */
void Calculate_Voltage_Current(void) {
    uint32_t voltage_sum = 0, current_sum = 0;
    for (int i = 0; i < 128; i++) {
        voltage_sum += voltage_buffer[i];
        current_sum += current_buffer[i];
    }
    uint32_t voltage_avg = voltage_sum / 128;
    uint32_t current_avg = current_sum / 128;

    battery_voltage = (voltage_avg * 3.3 / 65535.0) / 0.6; // 전압(V)
    battery_current = (current_avg * 3.3 / 65535.0) / 0.1 * 1000; // 전류(mA)
    battery_power = battery_voltage * (battery_current / 1000) * 1000; // 전력(mW)
}

/**
 * @brief SPI 플래시 쓰기
 * @param addr 쓰기 시작 주소
 * @param data 데이터 포인터
 * @param size 데이터 크기
 */
void Write_SPI_Flash(uint32_t addr, void* data, uint32_t size) {
    uint8_t cmd[4];
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET); // CS 활성화

    // 쓰기 활성화
    cmd[0] = 0x06; // WREN
    HAL_SPI_Transmit(&hspi1, cmd, 1, 100);

    // 페이지 프로그램
    cmd[0] = 0x02; // Page Program
    cmd[1] = (addr >> 16) & 0xFF;
    cmd[2] = (addr >> 8) & 0xFF;
    cmd[3] = addr & 0xFF;
    HAL_SPI_Transmit(&hspi1, cmd, 4, 100);
    HAL_SPI_Transmit(&hspi1, (uint8_t*)data, size, 100);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET); // CS 비활성화

    // 쓰기 완료 대기
    do {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
        cmd[0] = 0x05; // RDSR
        HAL_SPI_Transmit(&hspi1, cmd, 1, 100);
        HAL_SPI_Receive(&hspi1, cmd, 1, 100);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
    } while (cmd[0] & 0x01); // WIP 비트 확인
}

/**
 * @brief SPI 플래시 읽기
 * @param addr 읽기 시작 주소
 * @param data 데이터 저장 포인터
 * @param size 읽기 크기
 */
void Read_SPI_Flash(uint32_t addr, void* data, uint32_t size) {
    uint8_t cmd[4];
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);

    cmd[0] = 0x03; // Read Data
    cmd[1] = (addr >> 16) & 0xFF;
    cmd[2] = (addr >> 8) & 0xFF;
    cmd[3] = addr & 0xFF;
    HAL_SPI_Transmit(&hspi1, cmd, 4, 100);
    HAL_SPI_Receive(&hspi1, (uint8_t*)data, size, 100);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
}

/**
 * @brief SPI 플래시 섹터 지우기
 * @param sector 지울 섹터 번호
 */
void Erase_SPI_Flash_Sector(uint32_t sector) {
    uint8_t cmd[4];
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);

    cmd[0] = 0x06; // WREN
    HAL_SPI_Transmit(&hspi1, cmd, 1, 100);

    cmd[0] = 0x20; // Sector Erase
    cmd[1] = (sector * 4096 >> 16) & 0xFF;
    cmd[2] = (sector * 4096 >> 8) & 0xFF;
    cmd[3] = 0;
    HAL_SPI_Transmit(&hspi1, cmd, 4, 100);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);

    // 지우기 완료 대기
    do {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
        cmd[0] = 0x05; // RDSR
        HAL_SPI_Transmit(&hspi1, cmd, 1, 100);
        HAL_SPI_Receive(&hspi1, cmd, 1, 100);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
    } while (cmd[0] & 0x01);
}

/**
 * @brief 전체 SPI 플래시 지우기
 * @details W25Q128 칩 전체 지우기, 완료 후 메타데이터 초기화
 */
void Erase_SPI_Flash_Chip(void) {
    uint8_t cmd[1];
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);

    cmd[0] = 0x06; // WREN
    HAL_SPI_Transmit(&hspi1, cmd, 1, 100);

    cmd[0] = 0xC7; // Chip Erase
    HAL_SPI_Transmit(&hspi1, cmd, 1, 100);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);

    LED_Flash(1); // 진행 중 빠른 점멸
    // 지우기 완료 대기
    do {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
        cmd[0] = 0x05; // RDSR
        HAL_SPI_Transmit(&hspi1, cmd, 1, 100);
        HAL_SPI_Receive(&hspi1, cmd, 1, 100);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
    } while (cmd[0] & 0x01);

    LED_Flash(2); // 완료 시 느린 점멸
    HAL_UART_Transmit(&huart1, (uint8_t*)"SPI Flash chip erased\n", 22, 100);

    // 메타데이터 초기화
    FlashMetadata metadata = {
        .last_write_addr = FLASH_DATA_ADDR,
        .sector_index = FLASH_DATA_SECTOR,
        .init_flag = INIT_FLAG
    };
    Write_Flash_Metadata(&metadata);
}

/**
 * @brief 데이터 로그 초기화
 * @details 데이터 섹터 지우고 기록 포인터 재설정
 */
void Reset_Data_Log(void) {
    LED_Flash(1); // 진행 중 빠른 점멸
    Erase_SPI_Flash_Sector(FLASH_DATA_SECTOR);
    FlashMetadata metadata = {
        .last_write_addr = FLASH_DATA_ADDR,
        .sector_index = FLASH_DATA_SECTOR,
        .init_flag = INIT_FLAG
    };
    Write_Flash_Metadata(&metadata);
    LED_Flash(2); // 완료 시 느린 점멸
    HAL_UART_Transmit(&huart1, (uint8_t*)"Data log reset\n", 15, 100);
}

/**
 * @brief 메타데이터 읽기
 * @param metadata 메타데이터 구조체 포인터
 */
void Read_Flash_Metadata(FlashMetadata* metadata) {
    Read_SPI_Flash(FLASH_METADATA_ADDR, metadata, sizeof(FlashMetadata));
}

/**
 * @brief 메타데이터 쓰기
 * @param metadata 메타데이터 구조체 포인터
 */
void Write_Flash_Metadata(FlashMetadata* metadata) {
    Erase_SPI_Flash_Sector(0);
    Write_SPI_Flash(FLASH_METADATA_ADDR, metadata, sizeof(FlashMetadata));
}

/**
 * @brief CRC16 계산
 * @param data 데이터 포인터
 * @param size 데이터 크기
 * @return CRC16 값
 */
uint16_t Calculate_CRC16(void* data, uint32_t size) {
    uint16_t crc = 0xFFFF;
    uint8_t* buffer = (uint8_t*)data;
    for (uint32_t i = 0; i < size; i++) {
        crc ^= buffer[i];
        for (uint8_t j = 0; j < 8; j++) {
            if (crc & 0x0001) {
                crc = (crc >> 1) ^ 0xA001; // CRC-16-IBM
            } else {
                crc >>= 1;
            }
        }
    }
    return crc;
}

/**
 * @brief UART 데이터 처리
 * @details "SET_TIME" 및 "GET_BATTERY_STATUS" 명령 처리
 */
void Process_UART_Data(void) {
    if (uart_rx_buffer[uart_rx_index] == '\n' || uart_rx_buffer[uart_rx_index] == '\r') {
        uart_rx_buffer[uart_rx_index] = '\0';
        if (strncmp((char*)uart_rx_buffer, "SET_TIME ", 9) == 0) {
            uint16_t year;
            uint8_t month, day, hour, minute;
            // 날짜/시간 파싱
            if (sscanf((char*)uart_rx_buffer, "SET_TIME %hu/%hhu/%hhu %hhu:%hhu",
                       &year, &month, &day, &hour, &minute) == 5) {
                if (Validate_DateTime(year, month, day, hour, minute)) {
                    Set_RTC(year, month, day, hour, minute);
                    HAL_UART_Transmit(&huart1, (uint8_t*)"RTC set successfully\n", 21, 100);
                } else {
                    HAL_UART_Transmit(&huart1, (uint8_t*)"Invalid date/time\n", 18, 100);
                }
            } else {
                HAL_UART_Transmit(&huart1, (uint8_t*)"Invalid format\n", 15, 100);
            }
        } else if (strcmp((char*)uart_rx_buffer, "GET_BATTERY_STATUS") == 0) {
            Analyze_Battery_Status(); // 배터리 상태 분석
        } else {
            HAL_UART_Transmit(&huart1, (uint8_t*)"Unknown command\n", 16, 100);
        }
        uart_rx_index = 0;
        memset(uart_rx_buffer, 0, UART_RX_BUFFER_SIZE);
    } else {
        uart_rx_index++;
        if (uart_rx_index >= UART_RX_BUFFER_SIZE) {
            uart_rx_index = 0;
            memset(uart_rx_buffer, 0, UART_RX_BUFFER_SIZE);
            HAL_UART_Transmit(&huart1, (uint8_t*)"Buffer overflow\n", 16, 100);
        }
    }
    HAL_UART_Receive_IT(&huart1, &uart_rx_buffer[uart_rx_index], 1);
}

/**
 * @brief 날짜/시간 유효성 검증
 * @param year 연도 (2000~2099)
 * @param month 월 (1~12)
 * @param day 일 (1~31)
 * @param hour 시 (0~23)
 * @param minute 분 (0~59)
 * @return 1: 유효, 0: 무효
 */
int Validate_DateTime(uint16_t year, uint8_t month, uint8_t day, uint8_t hour, uint8_t minute) {
    if (year < 2000 || year > 2099 || month < 1 || month > 12 ||
        day < 1 || day > 31 || hour > 23 || minute > 59) {
        return 0;
    }

