wirex/stm32h7/stm32h7_battery_monitor_flash_uart_spi.c
    uint8_t days_in_month[] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    if (month == 2) {
        if ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0)) {
            days_in_month[1] = 29; // 윤년 처리
        }
    }
    if (day > days_in_month[month - 1]) {
        return 0;
    }

    return 1;
}

/**
 * @brief RTC 시간 설정
 * @param year 연도
 * @param month 월
 * @param day 일
 * @param hour 시
 * @param minute 분
 */
void Set_RTC(uint16_t year, uint8_t month, uint8_t day, uint8_t hour, uint8_t minute) {
    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};

    sTime.Hours = hour;
    sTime.Minutes = minute;
    sTime.Seconds = 0;
    HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);

    sDate.Year = year - 2000;
    sDate.Month = month;
    sDate.Date = day;
    HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
}

/**
 * @brief 배터리 상태 분석
 * @details SPI 플래시 데이터 읽고 총 에너지, 평균 전압/전류/전력 계산
 */
void Analyze_Battery_Status(void) {
    FlashMetadata metadata;
    Read_Flash_Metadata(&metadata);
    uint32_t current_addr = FLASH_DATA_ADDR;
    uint32_t end_addr = metadata.last_write_addr;
    if (end_addr < FLASH_DATA_ADDR) end_addr = FLASH_DATA_ADDR;

    float total_energy_wh = 0;
    float voltage_sum = 0, current_sum = 0, power_sum = 0;
    uint32_t valid_records = 0;
    uint32_t start_time = 0xFFFFFFFF, end_time = 0;
    uint32_t error_count = 0;

    // 데이터 순차적 읽기
    while (current_addr < end_addr) {
        Read_SPI_Flash(current_addr, spi_rx_buffer, SPI_RX_BUFFER_SIZE);
        for (uint32_t i = 0; i < SPI_RX_BUFFER_SIZE && current_addr < end_addr; ) {
            if (current_addr + DATA_10S_SIZE <= end_addr && i + DATA_10S_SIZE <= SPI_RX_BUFFER_SIZE) {
                DataRecord10s* record = (DataRecord10s*)(spi_rx_buffer + i);
                uint16_t calc_crc = Calculate_CRC16(record, DATA_10S_SIZE - 2);
                if (calc_crc == record->crc && record->timestamp != 0xFFFFFFFF) {
                    voltage_sum += record->voltage;
                    current_sum += record->current;
                    power_sum += record->power;
                    total_energy_wh += (record->power / 1000.0) * (10.0 / 3600.0); // mW to Wh
                    if (record->timestamp < start_time) start_time = record->timestamp;
                    if (record->timestamp > end_time) end_time = record->timestamp;
                    valid_records++;
                } else {
                    error_count++;
                }
                i += DATA_10S_SIZE;
                current_addr += DATA_10S_SIZE;
            } else if (current_addr + DATA_1MIN_SIZE <= end_addr && i + DATA_1MIN_SIZE <= SPI_RX_BUFFER_SIZE) {
                DataRecord1min* record = (DataRecord1min*)(spi_rx_buffer + i);
                uint16_t calc_crc = Calculate_CRC16(record, DATA_1MIN_SIZE - 2);
                if (calc_crc == record->crc) {
                    voltage_sum += record->avg_voltage;
                    current_sum += record->avg_current;
                    power_sum += record->avg_power;
                    total_energy_wh += (record->avg_power / 1000.0) * (60.0 / 3600.0);
                    valid_records++;
                } else {
                    error_count++;
                }
                i += DATA_1MIN_SIZE;
                current_addr += DATA_1MIN_SIZE;
            } else {
                break;
            }
        }
    }

    // 결과 출력
    char output[128];
    if (valid_records > 0) {
        uint32_t start_hour = start_time / 3600;
        uint32_t start_min = (start_time % 3600) / 60;
        uint32_t start_sec = start_time % 60;
        uint32_t end_hour = end_time / 3600;
        uint32_t end_min = (end_time % 3600) / 60;
        uint32_t end_sec = end_time % 60;

        snprintf(output, sizeof(output),
                 "Battery Status: %04lu/%02lu/%02lu %02lu:%02lu:%02lu to %04lu/%02lu/%02lu %02lu:%02lu:%02lu, "
                 "Total Energy=%.2fWh, Avg V=%.2fV, Avg I=%.2fmA, Avg P=%.2fmW, Errors=%lu\n",
                 2000 + (start_time / (3600 * 24 * 365)) % 100, (start_time / (3600 * 24)) % 12 + 1, (start_time / (3600 * 24)) % 30 + 1,
                 start_hour, start_min, start_sec,
                 2000 + (end_time / (3600 * 24 * 365)) % 100, (end_time / (3600 * 24)) % 12 + 1, (end_time / (3600 * 24)) % 30 + 1,
                 end_hour, end_min, end_sec,
                 total_energy_wh, voltage_sum / valid_records, current_sum / valid_records, power_sum / valid_records,
                 error_count);
    } else {
        snprintf(output, sizeof(output), "No valid data found\n");
    }
    HAL_UART_Transmit(&huart1, (uint8_t*)output, strlen(output), 100);
}

/**
 * @brief UART 수신 콜백
 * @param huart UART 핸들
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    if (huart->Instance == USART1) {
        Process_UART_Data();
    }
}

/**
 * @brief UART 에러 콜백
 * @param huart UART 핸들
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
    if (huart->Instance == USART1) {
        uart_rx_index = 0;
        memset(uart_rx_buffer, 0, UART_RX_BUFFER_SIZE);
        HAL_UART_Transmit(&huart1, (uint8_t*)"UART error\n", 12, 100);
        HAL_UART_Receive_IT(&huart1, &uart_rx_buffer[uart_rx_index], 1);
    }
}

/**
 * @brief 버튼 EXTI 콜백
 * @param GPIO_Pin 인터럽트 발생 핀
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == GPIO_PIN_1 && button_state == 0) {
        button_state = 1;
        button_press_time = HAL_GetTick();
        HAL_TIM_Base_Start(&htim2); // 타이머 시작
    }
}

/**
 * @brief 타이머 주기 콜백
 * @param htim 타이머 핸들
 * @details 버튼 디바운싱 및 긴 누름 감지
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM2) {
        static uint32_t last_check = 0;
        uint32_t current_time = HAL_GetTick();

        if (button_state == 1 && (current_time - button_press_time) >= BUTTON_DEBOUNCE_MS) {
            if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1) == GPIO_PIN_RESET) {
                // 버튼 누름 유지
                if ((current_time - button_press_time) >= BUTTON_LONG_PRESS_MS) {
                    button_state = 2;
                    Erase_SPI_Flash_Chip(); // 긴 누름: 전체 초기화
                    HAL_TIM_Base_DeInit(&htim2);
                }
            } else {
                // 버튼 떼짐
                if (button_state == 1 && (current_time - button_press_time) < BUTTON_LONG_PRESS_MS) {
                    Reset_Data_Log(); // 짧은 누름: 데이터 로그 초기화
                }
                button_state = 0;
                HAL_TIM_Base_DeInit(&htim2);
            }
        }
    }
}

/**
 * @brief ADC 변환 완료 콜백
 * @param hadc ADC 핸들
 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
    if (hadc == &hadc1 || hadc == &hadc2) {
        // ADC 변환 완료
    }
}